content/programming/notes/the-value-of-c.org
#+startup: content indent

[[file:../../index.org][Giovanni's Diary]] > [[file:../../subjects.org][Subjects]] > [[file:../programming.org][Programming]] > [[file:notes.org][Notes]] >

* The value of C: A lesson on simplicity

In this blog post, I will tell a tale of discovery and enlightenment,
of growth and humbling. I will reflect on the ups and downs of my
relationship with the C programming language, and how that shaped the
programmer that I am, and made me grow and shine as a software
developer in the modern era.

TODO

-----

Travel: [[file:notes.org][Programming Notes]], [[../../theindex.org][Index]]
